In [1]:
import pandas as pd
import numpy as np

## READING DATA USING PANDAS
   We use pandas read_csv function to read the csv file in python and pandas DataFrame method to convert file into the data frame.

In [4]:
df = pd.DataFrame(pd.read_csv('Titanic Survivor dataset.csv'))

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

 ### Description of the attributes of the  datset
 Pclass : Passenger Class( 1 = 1st ; 2 =2nd ; 3 = 3rd)                 
 survival: Survial(0 = No ; 1=Yes)                                     
 name : Name                                                           
 sex : Sex                                                             
 age : Age                                                             
 sibsp : Number of Sibilings/Spouses Aboard                             
 parch : Number of Parents/Children Aboard                             
 ticket : Ticket Number                                                 
 fare : Passenger Fare(British pound)                                   
 cabin : Cabin                                                         
 embarked : Port of Embarkation(C=Cherbourg;Q=Queenstown;S=Southampton)

In [7]:
df.shape

(891, 12)

## Handling Null Values
The dataset may contains many rows and columns for which some values are missing, we can't leave those missing values as it is.             In such cases we have two options:
1. Either drop the entire row or column  
2.Fill the missing values with some appropriate value let's say mean of all the values for that column may do the job.

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Separating out the columns which have more than 35% of the values missing in the dataset

In [15]:
x= df.isnull().sum()
drop_col = x[x>(35/100 * df.shape[0])]

In [16]:
drop_col

Cabin    687
dtype: int64

In [17]:
drop_col.index

Index(['Cabin'], dtype='object')

In [18]:
df.drop(drop_col.index,axis=1,inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [19]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [21]:
df.fillna(df.mean(),inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

> Because Embarked contains string Values, we see the details of that column separately from others as strings does not have mean and all.

In [23]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For Embarked attribute, we fill the NULL values with the most frequent value in the column.

In [24]:
df['Embarked'].fillna('S',inplace = True)

In [25]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [27]:
 df.corr()      #correalation funtion tells the relation between different columns.

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.033207,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.069809,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.331339,0.083081,0.018443,-0.549500
Age,0.033207,-0.069809,-0.331339,1.000000,-0.232625,-0.179191,0.091566
SibSp,-0.057527,-0.035322,0.083081,-0.232625,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.179191,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.091566,0.159651,0.216225,1.000000

- We can also make a new column family_size ny combining 'SibSp' and 'Parch' columns

In [28]:
df['Family_size']=df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'],axis=1,inplace=True)

In [29]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,Family_size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S,0

In [30]:
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  Family_size
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658    -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307     0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500     0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566    -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000     0.217138
Family_size    -0.040143  0.016639  0.065997 -0.248512  0.217138     1.000000

Family_size in the ship does not have much correlance with survival rate

- Let's check if we weather the person was alone or not can affect the survival rate.

In [31]:
df['Alone']=[0 if df['Family_size'][i]>0 else 1 for i in df.index]

In [32]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,Family_size,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S,0,1

In [33]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

- If the person is alone he/she has less chance of surviving.
> The reason might be the person who is travelling with his family might be belonging to rich class and might be prioritized over other.

In [34]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

So we can see if the person was not alone, the chance the ticket price is higher is high.

In [35]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]   # 1 for female, 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows, female passengers have more chance of surviving than male ones.

It shows womens were prioritized over men.

In [36]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

We can see that the percentage of survival is more for people who has the Embarkation port was 'C' and it is minimum for people having Embarkation port as 'S'.

# CONCLUSION
 > 
   - Female passengers were prioritized over men.
   - People with high class or rich people have higher survival rate than others. The hierarichy might have been followed while saving the passengers.
   - Passengers travelling with their family have higher survival rate.
   - Pasengers who borded the ship at Cherbourg survived more in proportion to the others.